"""6.	* Реализовать структуру данных «Товары». Она должна представлять собой
список кортежей. Каждый КОРТЕЖ хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами,
то есть  характеристиками товара: название, цена, количество, единица измерения.
Структуру нужно сформировать программно, запросив все данные у пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Нужно собрать аналитику о товарах. Реализовать СЛОВАРЬ, в котором каждый ключ —
характеристика товара, например, название. Тогда значения —
список значений-характеристик, например, список названий товаров.
Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""

products = []
for i in range(1, 4):
    print(f"Информация о товаре {i}")
    product_name = input("Название: ")
    product_price = int(input("Цена: "))
    product_qty = int(input("Количество: "))
    product_measure = input("Единица измерения: ")
    products.append((i, {'название': product_name, 'цена': product_price,
                         'количество': product_qty, 'eд': product_measure}))

print(f"Исходные данные по товару: \n{products}")

product_names = []
product_prices = []
product_qty = []
product_measures = []
for i in products:
    product_names.append(i[1].get('название'))
    product_prices.append(i[1].get('цена'))
    product_qty.append(i[1].get('количество'))
    product_measures.append(i[1].get('eд'))

report = {
    'название': list(set(product_names)),
    'цена': list(set(product_prices)),
    'количество': list(set(product_qty)),
    'eд': list(set(product_measures))
}

print(f"Отчет по списку товаров: \n{report}")
